Masmiseim36/nxpSDK/boards/twrkv58f220m/demo_apps/mc_bldc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTE28 (number 49), DRV_EN
  @{ */
#define PINTOOL_MISC_DRV_EN_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define PINTOOL_MISC_DRV_EN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_MISC_DRV_EN_PIN 28U    /*!<@brief PORTE pin index: 28 */
                                       /* @} */

/*! @name PORTB6 (number 87), USER_LED
  @{ */
#define PINTOOL_MISC_USER_LED_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define PINTOOL_MISC_USER_LED_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_MISC_USER_LED_PIN 6U     /*!<@brief PORTB pin index: 6 */
                                         /* @} */

/*! @name PORTA4 (number 54), SW2
  @{ */
#define PINTOOL_MISC_SW2_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_SW2_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_SW2_PIN 4U     /*!<@brief PORTA pin index: 4 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_PWM(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_SPI(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 receive data source select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB0 (number 81), DEBUG_UART_RX
  @{ */
#define PINTOOL_UART_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_RX_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                              /* @} */

/*! @name PORTB1 (number 82), DEBUG_UART_TX
  @{ */
#define PINTOOL_UART_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_TX_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
